ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_setStoreCategories_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
	<soapenv:Header></soapenv:Header>
	<soapenv:Body>
		<urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
		<urn:appId>%s(appId)</urn:appId>
		<urn:version>%s(version)</urn:version>
		<urn:routing>%s(routing)</urn:routing>
		<urn:siteId>%s(siteId)</urn:siteId>
		<urn:authToken>%s(authToken)</urn:authToken>
		<urn:action>Rename</urn:action>
		<urn:storeCategories xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
			<ebl:CustomCategory>
				<ebl:CategoryID>%s(customCategoryId)</ebl:CategoryID>
				<ebl:Name>%s(nameOptional)</ebl:Name>
				<ebl:Order>3</ebl:Order>
			</ebl:CustomCategory>
		</urn:storeCategories>
		<!-- Send Connector method name to be called -->
		<urn:method>setStoreCategories</urn:method>
	</soapenv:Body>
</soapenv:Envelope>